; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob33) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate5)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear crate6)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 depot0)
	(clear crate2)
	(at pallet10 distributor0)
	(clear pallet10)
	(at pallet11 depot2)
	(clear crate0)
	(at pallet12 depot1)
	(clear crate7)
	(at pallet13 distributor0)
	(clear pallet13)
	(at truck0 depot2)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at hoist11 depot2)
	(available hoist11)
	(at hoist12 distributor2)
	(available hoist12)
	(at crate0 depot2)
	(on crate0 pallet11)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 depot0)
	(on crate2 pallet9)
	(at crate3 depot1)
	(on crate3 pallet12)
	(at crate4 depot1)
	(on crate4 crate3)
	(at crate5 distributor0)
	(on crate5 pallet3)
	(at crate6 depot1)
	(on crate6 pallet6)
	(at crate7 depot1)
	(on crate7 crate4)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet9)
		(on crate2 pallet6)
		(on crate3 pallet13)
		(on crate4 pallet3)
		(on crate5 pallet11)
		(on crate6 pallet8)
		(on crate7 pallet5)
	)
))

; plan
1. (drive truck1 distributor0 depot1)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot1)
   goals met: 0 of 8
2. (lift hoist8 crate0 pallet11 depot2)
   deleted: (at crate0 depot2) (clear crate0) (available hoist8) (on crate0 pallet11)
   added: (lifting hoist8 crate0) (clear pallet11)
   goals met: 0 of 8
3. (load hoist8 crate0 truck0 depot2)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck0) (available hoist8)
   goals met: 0 of 8
4. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 0 of 8
5. (lift hoist0 crate2 pallet9 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet9)
   added: (lifting hoist0 crate2) (clear pallet9)
   goals met: 0 of 8
6. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   goals met: 0 of 8
7. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 0 of 8
8. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 0 of 8
9. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 1 of 8
10. (lift hoist3 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 pallet3)
   added: (lifting hoist3 crate5) (clear pallet3)
   goals met: 1 of 8
11. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 1 of 8
12. (load hoist3 crate5 truck1 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck1) (available hoist3)
   goals met: 1 of 8
13. (drive truck1 distributor0 depot2)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot2)
   goals met: 1 of 8
14. (unload hoist8 crate5 truck1 depot2)
   deleted: (in crate5 truck1) (available hoist8)
   added: (lifting hoist8 crate5)
   goals met: 1 of 8
15. (drop hoist8 crate5 pallet11 depot2)
   deleted: (lifting hoist8 crate5) (clear pallet11)
   added: (available hoist8) (at crate5 depot2) (clear crate5) (on crate5 pallet11)
   goals met: 2 of 8
16. (lift hoist1 crate7 crate4 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist1) (on crate7 crate4)
   added: (lifting hoist1 crate7) (clear crate4)
   goals met: 2 of 8
17. (load hoist1 crate7 truck0 depot1)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 2 of 8
18. (lift hoist1 crate4 crate3 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 2 of 8
19. (load hoist1 crate4 truck0 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck0) (available hoist1)
   goals met: 2 of 8
20. (lift hoist1 crate6 pallet6 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet6)
   added: (lifting hoist1 crate6) (clear pallet6)
   goals met: 2 of 8
21. (load hoist1 crate6 truck0 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck0) (available hoist1)
   goals met: 2 of 8
22. (unload hoist1 crate2 truck0 depot1)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 2 of 8
23. (drop hoist1 crate2 pallet6 depot1)
   deleted: (lifting hoist1 crate2) (clear pallet6)
   added: (available hoist1) (at crate2 depot1) (clear crate2) (on crate2 pallet6)
   goals met: 3 of 8
24. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 3 of 8
25. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 3 of 8
26. (lift hoist1 crate3 pallet12 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 pallet12)
   added: (lifting hoist1 crate3) (clear pallet12)
   goals met: 3 of 8
27. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 3 of 8
28. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 3 of 8
29. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 3 of 8
30. (unload hoist3 crate3 truck0 distributor0)
   deleted: (in crate3 truck0) (available hoist3)
   added: (lifting hoist3 crate3)
   goals met: 3 of 8
31. (drop hoist3 crate3 pallet13 distributor0)
   deleted: (lifting hoist3 crate3) (clear pallet13)
   added: (available hoist3) (at crate3 distributor0) (clear crate3) (on crate3 pallet13)
   goals met: 4 of 8
32. (unload hoist3 crate4 truck0 distributor0)
   deleted: (in crate4 truck0) (available hoist3)
   added: (lifting hoist3 crate4)
   goals met: 4 of 8
33. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 4 of 8
34. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 4 of 8
35. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 4 of 8
36. (unload hoist9 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist9)
   added: (lifting hoist9 crate6)
   goals met: 4 of 8
37. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 4 of 8
38. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   goals met: 4 of 8
39. (drop hoist3 crate4 pallet3 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet3)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 pallet3)
   goals met: 5 of 8
40. (drop hoist0 crate1 pallet9 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet9)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet9)
   goals met: 6 of 8
41. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 7 of 8
42. (drop hoist9 crate6 pallet8 distributor1)
   deleted: (lifting hoist9 crate6) (clear pallet8)
   added: (available hoist9) (at crate6 distributor1) (clear crate6) (on crate6 pallet8)
   goals met: 8 of 8
